Table of Contents
 Enum FatigueMethod
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Verification of concrete under compression or shear
public enum FatigueMethod
Fields
Method_6_8_7_1 = 1
method 6.8.7 (1) according to EN 1992-1-1
Method_6_8_7_101 = 3
method 6.8.7 (101) according to EN 1992-2
Method_6_8_7_101_ANNEX_NEN = 4
method 6.8.7 (101) according to EN 1992-2
Method_6_8_7_2 = 2
method 6.8.7 (2) according to EN 1992-1-1
Method_6_8_7_2_Shear = 13
method 6.8.7 (2) according to EN 1992-1-1 under shear
Method_NN112 = 8
EN 1992-2, annex NN eq. NN.112
Method_Prestress_6_8_5_3 = 7
6.8.5 Verification using damage equivalent stress range - prestress
Method_Reinf_6_8_5_3 = 6
6.8.5 Verification using damage equivalent stress range - reinfrocement
Method_Reinf_6_8_5_3_Shear = 14
6.8.5 Verification of concrete under compression or shear
Method_Reinf_NN102 = 9
reinforcement EN 1992-2, annex NN eq. NN.102
Method_Reinf_NN107 = 10
reinforcement EN 1992-2, annex NN eq. NN.107
Method_Shear_6_8_7_4 = 5
6.8.7 Verification of concrete under compression or shear
Method_Tendon_NN102 = 11
tendon EN 1992-2, annex NN eq. NN.102
Method_Tendon_NN107 = 12
tendon EN 1992-2, annex NN eq. NN.107
notSet = 0
the method has not been set
Fields
 Name |  Description
 Method_6_8_7_1 = 1
method 6.8.7 (1) according to EN 1992-1-1
 Method_6_8_7_101 = 3
method 6.8.7 (101) according to EN 1992-2
 Method_6_8_7_101_ANNEX_NEN = 4
method 6.8.7 (101) according to EN 1992-2
 Method_6_8_7_2 = 2
method 6.8.7 (2) according to EN 1992-1-1
 Method_6_8_7_2_Shear = 13
method 6.8.7 (2) according to EN 1992-1-1 under shear
 Method_NN112 = 8
EN 1992-2, annex NN eq. NN.112
 Method_Prestress_6_8_5_3 = 7
6.8.5 Verification using damage equivalent stress range - prestress
 Method_Reinf_6_8_5_3 = 6
6.8.5 Verification using damage equivalent stress range - reinfrocement
 Method_Reinf_6_8_5_3_Shear = 14
6.8.5 Verification of concrete under compression or shear
 Method_Reinf_NN102 = 9
reinforcement EN 1992-2, annex NN eq. NN.102
 Method_Reinf_NN107 = 10
reinforcement EN 1992-2, annex NN eq. NN.107
 Method_Shear_6_8_7_4 = 5
6.8.7 Verification of concrete under compression or shear
 Method_Tendon_NN102 = 11
tendon EN 1992-2, annex NN eq. NN.102
 Method_Tendon_NN107 = 12
tendon EN 1992-2, annex NN eq. NN.107
 notSet = 0
the method has not been set
 Edit this page